# ðŸ“Š Pivot Table ile Veri Ã–zeti
Bu notebook, Pandas kullanarak nasÄ±l pivot table oluÅŸturulacaÄŸÄ±nÄ± gÃ¶sterir.

---

ðŸ“Œ Pivot Table Nedir?
Pivot tablo, verileri gruplayarak Ã¶zetlemeye yarar.
Excelâ€™deki gibi dÃ¼ÅŸÃ¼n:

SatÄ±ra bir ÅŸey, sÃ¼tuna baÅŸka bir ÅŸey koyarsÄ±n, deÄŸerleri ortalama/toplam olarak gÃ¶sterirsin.

ðŸ”§ Pandasâ€™ta Pivot Table Sentezi:
Temel YapÄ±:

pd.pivot_table(
    data = df,                # DataFrame'imiz
    index = "satÄ±r deÄŸiÅŸkeni",     # Gruplama yapÄ±lacak alan (satÄ±r)
    columns = "sÃ¼tun deÄŸiÅŸkeni",   # Opsiyonel â€“ sÃ¼tun grubu
    values = "deÄŸer",              # SayÄ±sal Ã¶zetlenecek alan
    aggfunc = "mean"               # Ortalama, toplam, say, vs.
)

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

# Ã–rnek veri (HR Data.csv dosyasÄ±nÄ± yÃ¼kle)
df = pd.read_csv("HR Data.csv")

## ðŸ”¹ Ã–rnek 1: Department bazÄ±nda ortalama maaÅŸ

In [2]:
pd.pivot_table(df, index="Department", values="MonthlyIncome", aggfunc="mean")

                        MonthlyIncome
Department
Human Resources           6654.507937
Research & Development    6281.252862
Sales                     6959.172646

## ðŸ”¹ Ã–rnek 2: Department & Education kombinasyonlarÄ± iÃ§in ortalama maaÅŸ

In [3]:
pd.pivot_table(df, index="Department", columns="Education", values="MonthlyIncome", aggfunc="mean")

Education,1,2,3,4,5
Department,,,,,
Human Resources,2776.60000,4782.923077,6760.555556,9711.133333,4990.333333
Research & Development,5770.86087,6190.093407,6220.704485,6425.972549,8325.600000
Sales,5627.30000,6518.839080,7154.777108,7304.734375,8839.200000

## ðŸ”¹ Ã–rnek 3: Her JobRole iÃ§in kaÃ§ kiÅŸi var?

In [4]:
pd.pivot_table(df, index="JobRole", values="EmployeeNumber", aggfunc="count")

                           EmployeeNumber
JobRole
Healthcare Representative             131
Human Resources                        52
Laboratory Technician                 259
Manager                               102
Manufacturing Director                145
Research Director                      80
Research Scientist                    292
Sales Executive                       326
Sales Representative                   83

## ðŸ”¹ Mini Challenge GÃ¶revleri

In [8]:
# 1. MaritalStatus iÃ§in ortalama TotalWorkingYears
pd.pivot_table(df, index = "MaritalStatus", values = "TotalWorkingYears", aggfunc = "mean")

               TotalWorkingYears
MaritalStatus
Divorced               11.807339
Married                11.732541
Single                 10.263830

In [9]:
# 2. Gender ve Attrition iÃ§in ortalama MonthlyIncome
pd.pivot_table(df, index = "Gender", columns = "Attrition", values = "MonthlyIncome", aggfunc = "mean")

Attrition           No          Yes
Gender
Female     7019.429142  4769.735632
Male       6704.964481  4797.160000

In [ ]:
# 3. BusinessTravel & Department iÃ§in ortalama DistanceFromHome
pd.pivot_table(df, index = "BusinessTravel", columns = "Department", values = "DistanceFromHome", aggfunc = "mean")

Department         Human Resources  Research & Development      Sales
BusinessTravel
Non-Travel                6.166667                8.783505  12.234043
Travel_Frequently         9.818182                9.362637   9.023810
Travel_Rarely             8.760870                9.137830   9.028571